/*
 * Функція зворотнього виклику (callback)
 * - Функція може приймати інші функції як параметри
 * - Функція яка передається іншій функції як аргумент називається
 *   «функцією зворотнього (відкладеного) виклику» (callback-функція)
 * - Функція яка приймає іншу функцію як параметр
 *   або повертає функцію як результат соєї роботи називається
 *   «функцією вищого порядку»
 */

/*
 * функция doMath(a, b, callback)
 */
const fnA = function(message,callback){
    console.log(message);
};
const fnB= function(){
    console.log('Це косольлог функції fnB');
} ;
fnA('string',fnB);

/*
 * Відкладений виклик: регістрація подій
 */

/*
 * Відкладений виклик: геолокація
 */

// window.navigator.geolocation.getCurrentPosition();
/*
 * Відкладений виклик: інтервали
 */

// console.log('В коді перед таймаутом');
// console.log('Через три секунди в середені колбека в таймауті');
// console.log('В коді після таймаута');
