/*
 * Функція зворотнього виклику (callback)
 * - Функція може приймати інші функції як параметри
 * - Функція яка передається іншій функції як аргумент називається
 *   «функцією зворотнього (відкладеного) виклику» (callback-функція)
 * - Функція яка приймає іншу функцію як параметр
 *   або повертає функцію як результат соєї роботи називається
 *   «функцією вищого порядку»
 */

/*
 * функция doMath(a, b, callback)
 */

/*
 * Відкладений виклик: регістрація подій
 */

/*
 * Відкладений виклик: геолокація
 */

/*
 * Відкладений виклик: інтервали
 */

/*
 * Відкладений виклик: http-запит
 * - API URL: https://pokeapi.co/api/v2/pokemon
 */

/*
 * Фільтр
 */
